// ポケモンデータ
const pokemonData = [
	{ id: 1, name: "ピカチュウ", type: "でんき", rarity: "☆" },
	{ id: 2, name: "フシギダネ", type: "くさ", rarity: "☆" },
	{ id: 3, name: "ヒトカゲ", type: "ほのお", rarity: "☆" },
	{ id: 4, name: "ゼニガメ", type: "みず", rarity: "☆" },
	{ id: 5, name: "リザードン", type: "ほのお", rarity: "★★" },
	{ id: 6, name: "フシギバナ", type: "くさ", rarity: "★★" },
	{ id: 7, name: "カメックス", type: "みず", rarity: "★★" },
	{ id: 8, name: "ミュウツー", type: "エスパー", rarity: "✦✦✦" },
	{ id: 9, name: "ミュウ", type: "エスパー", rarity: "✦✦✦" },
];
// 配列pokemonData を活用してテーブルにポケモンの一覧が表示されるようにする

//  「ポケモンを検索」入力フィールドを活用してリアルタイムでポケモン名で絞り込めるようにする

//  「タイプ」のセレクトボックスでタイプごとのポケモンを絞り込めるようにする

//  「ソート」のセレクトボックスでレアリティ順に並び替えできるようにする

//  ポケモンを追加できるようにする